var provname = [
    "北京", "天津", "河北" , "山西", "内蒙古", "辽宁",
    "吉林", "黑龙江", "江苏", "安徽", "山东", "上海", "浙江" , "江西",
    "福建", "湖北", "湖南", "河南" , "广东", "广西", "海南", "重庆",
    "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "宁夏", "青海",
    "新疆", "香港", "澳门", "台湾"
];
var provpinyin = [
    "beijing" , "tianjin", "hebei", "shanxi", "neimenggu", "liaoning",
    "jilin", "heilongjiang", "jiangsu", "anhui", "shandong", "shanghai", "zhejiang", "jiangxi",
    "fujian", "hubei", "hunan", "henan", "guangdong", "guangxi", "hainan", "chongqing",
    "sichuan", "guizhou", "yunnan", "xizang", "shaanxi", "gansu", "ningxia", "qinghai",
    "xinjiang", "xianggang", "aomen", "taiwan"
];
var prov2univ = {
    beijing: [
        "清华大学", "北京大学", "北京航空航天大学", "中国人民大学", "中国政法大学", "北京邮电大学", "北京师范大学",
        "北京理工大学", "北京外国语大学", "北京交通大学", "对外经济贸易大学", "北京大学医学部", "中央财经大学",
        "北京信息科技大学", "中国地质大学", "北京科技大学", "华北电力大学", "中央民族大学", "首都师范大学", "北京林业大学",
        "中国农业大学", "北京语言大学", "首都经济贸易大学", "中国矿业大学", "北方工业大学", "中央广播电视大学", "中国石油大学",
        "北京化工大学", "北京工商大学", "北京中医药大学", "中国人民公安大学", "首都医科大学", "北京工业大学", "北京联合大学",
        "北京体育大学", "北京电子科技职业学院", "北京财贸职业学院", "中国青年政治学院", "外交学院", "北京电影学院",
        "中央音乐学院", "中国传媒大学", "中央戏剧学院", "首钢工学院", "北京物资学院", "北京印刷学院", "北京石油化工学院",
        "华北科技学院", "北京联合大学应用文理学院", "北京舞蹈学院", "北京联合大学旅游学院", "中国协和医科大学",
        "北京联合大学机械工程学院", "北京联合大学商务学院", "北京航空航天大学安博软件工程学院", "北京第二外国语学院",
        "北京农学院", "中国音乐学院", "北京青年政治学院", "国际关系学院", "中国劳动关系学院", "北京电子科技学院",
        "中华女子学院", "北京华大研修学院", "中国戏曲学院", "国家法官学院", "首都体育学院", "北京工业大学通州分校",
        "北京汇佳职业学院", "北京城市学院", "华北科技学院", "中国社会科学院研究生院", "军事医学科学院", "北京科技职业学院"
    ],

    tianjin: [
        "天津大学", "南开大学", "天津师范大学", "天津医科大学", "天津商业大学", "天津外国语学院", "中国民用航空学院",
        "天津财经大学", "天津理工大学", "天津音乐学院", "天津科技大学", "天津农学院", "天津城市建设学院", "天津工程师范学院",
        "天津美术学院", "天津体育学院", "天津中医学院", "天津轻工职业技术学院", "天津商学院", "宝德职业技术学院",
        "天狮职业技术学院", "天津职业大学"
    ],

    hebei: [
        "华北电力大学", "河北大学", "河北师范大学", "河北经贸大学", "燕山大学", "河北科技大学", "河北工业大学",
        "河北医科大学", "河北北方学院", "河北广播电视大学", "河北工程大学", "中国人民武装警察部队学院", "北华航天工业学院",
        "华北煤炭医学院", "河北理工大学", "河北科技师范学院", "河北建筑工程学院", "承德石油高等专科学校", "河北体育学院",
        "河北政法职业学院", "河北石油职业技术学院", "石家庄铁道学院", "石家庄经济学院", "石家庄邮电职业技术学院",
        "石家庄职业技术学院", "石家庄学院", "保定学院", "邯郸职业技术学院", "东北大学秦皇岛分校", "唐山师范学院",
        "廊坊师范学院", "保定职业技术学院", "唐山学院", "河北交通职业技术学院", "河北金融学院", "石家庄铁路职业技术学院",
        "邯郸学院", "河北工程技术高等专科学校", "中央司法警官学院", "华北电力大学科技学院", "中国地质大学长城学院",
        "河北软件职业技术学院", "防灾科技学院", "北京社会管理职业学院", "河北劳动关系职业学院", "渤海石油职业学院",
        "石家庄东方美术学院", "石家庄工商职业学院", "石家庄医学高等专科学校", "唐山工业职业技术学院", "张家口教育学院",
        "张家口职业技术学院", "河北化工医药职业技术学院", "河北艺术职业学院", "保定电力职业技术学院", "石家庄科技工程职业学院"
    ],

    shanxi: [
        "山西大学", "中北大学", "太原理工大学", "山西师范大学", "山西财经大学", "山西农业大学", "太原科技大学",
        "太原工业学院", "山西忻州师范学院", "运城学院", "山西大学商务学院", "山西大学工程学院", "山西医科大学", "汾阳学院",
        "吕梁高专", "山西省财政税务专科学校", "山西交通职业技术学院", "山西中医学院", "晋中学院", "太原理工大学阳泉学院",
        "山西电力职业技术学院", "山西旅游职业学院", "山西煤炭职业技术学院", "山西综合职业技术学院", "太原大学太原师范学院"
    ],

    neimenggu: [
        "内蒙古大学", "内蒙古师范大学", "内蒙古工业大学", "内蒙古科技大学", "内蒙古农业大学", "内蒙古民族大学",
        "内蒙古财经学院", "内蒙古医学院", "包头师范学院", "包头职业技术学院", "包头医学院", "包头市职工大学", "包头铁道学院",
        "呼伦贝尔学院", "鄂尔多斯职业学院", "内蒙古北方职业技术学院", "内蒙古轩元职业学院", "内蒙古经贸外语职业学院",
        "内蒙古能源职业学院", "乌兰察布医学高等专科学校", "内蒙古丰州职业学院", "兴安职业技术学院", "呼伦贝尔职业技术学院",
        "内蒙古大学创业学院", "内蒙古师范大学鸿德学院", "内蒙古建筑职业技术学院", "内蒙古广播电视大学", "内蒙古科技大学",
        "包头师范学院", "内蒙古科技大学", "包头医学院", "集宁师范学院", "呼和浩特民族学院", "赤峰学院", "内蒙古化工职业学院",
        "内蒙古机电职业技术学院", "内蒙古商贸职业学院", "内蒙古电子信息职业技术学院", "呼和浩特职业学院", "内蒙古体育职业学院",
        "包头轻工职业技术学院", "包头铁道职业技术学院", "包头钢铁职业技术学院", "锡林郭勒职业学院", "河套大学",
        "乌海职业技术学院", "乌兰察布职业学院", "内蒙古交通职业技术学院", "科尔沁艺术职业学院", "通辽职业学院",
        "赤峰职业技术学院", "内蒙古科技职业学院", "内蒙古警察职业学院", "满洲里俄语职业学院"
    ],

    liaoning: [
        "中国医科大学", "东北大学", "渤海大学", "辽宁石油化工大学", "东北财经大学", "辽宁大学", "辽宁师范大学",
        "辽宁工程技术大学", "沈阳大学", "沈阳农业大学", "沈阳工业大学", "沈阳药科大学", "大连理工大学", "大连医科大学",
        "大连海事大学", "大连大学", "中国刑事警察学院", "大连水产学院", "辽宁工学院", "辽宁省交通高等专科学校",
        "沈阳理工大学", "沈阳航空工业学院", "沈阳建筑大学", "沈阳师范大学", "大连外国语学院", "大连职业技术学院",
        "辽宁科技学院", "沈阳体育学院", "鲁迅美术学院", "大连民族学院", "鞍山师范学院", "辽宁科技大学", "辽宁医学院",
        "大连广播电视大学", "大连交通大学软件学院", "辽宁对外经贸学院", "沈阳医学院", "辽宁中医药大学",
        "大连东软信息技术职业学院", "沈阳工程学院", "辽宁朝鲜族师范学校", "辽东学院", "大连交通大学信息工程学院",
        "渤海大学文理学院", "沈阳职业技术学院", "辽宁金融职业学院", "辽宁广告职业学院", "大连艺术职业学院",
        "东北大学大连艺术学院", "朝阳师范高等专科学校", "大连软件职业学院", "辽宁商贸职业学院", "辽宁工业大学",
        "辽宁石化职业技术学院", "沈阳建筑大学城市建设学院"
    ],

    jilin: [
        "东北师范大学", "吉林大学", "吉林师范大学", "吉林农业大学", "长春理工大学", "吉林化工学院", "长春工程学院",
        "延边大学", "东北电力大学", "吉林建筑工程学院", "长春汽车工业高等专科学校", "吉林电子信息职业技术学院",
        "吉林师范大学分校", "长春金融高等专科学校", "吉林工业职业技术学院", "长春工业大学", "吉林大学农学部",
        "长春税务学院国际交流学院", "吉林粮食高等专科学校", "吉林商业高等专科学校", "长春中医药大学", "通化师范学院",
        "吉林交通职业技术学院", "吉林艺术学院", "长春东方职业学院", "吉林华桥外国语学院", "长春信息职业技术学院",
        "吉林医药学院", "吉林交通职业技术学院", "吉林建筑工程学院建筑装饰学院", "长春医学高等专科学校",
        "长春工业大学人文信息学院", "长春信息技术职业学院", "吉林师范大学博达学院", "吉林省体育学院",
        "吉林省经济管理干部学院"
    ],

    heilongjiang: [
        "东北农业大学", "东北林业大学", "黑龙江大学", "哈尔滨商业大学", "黑龙江科技学院", "哈尔滨工程大学", "哈尔滨工业大学",
        "哈尔滨理工大学", "哈尔滨师范大学", "齐齐哈尔大学", "哈尔滨医科大学附属第二医院", "哈尔滨广播电视大学",
        "黑龙江广播电视大学", "哈尔滨学院", "大庆石油学院", "哈尔滨金融高等专科学校", "哈尔滨体育学院", "牡丹江师范学院",
        "大庆石油华瑞学院", "哈尔滨理工大学远东学院", "黑龙江大学剑桥学院", "大庆师范学院", "哈尔滨师范大学恒星学院",
        "绥化学院"
    ],

    jiangsu: [
        "东南大学", "南京大学", "南京理工大学", "苏州大学", "江南大学", "河海大学", "南京师范大学", "中国矿业大学",
        "南通大学", "南京工业大学", "南京邮电大学", "扬州大学", "江苏大学", "南京财经大学", "南京林业大学",
        "南京中医药大学", "南京航空航天大学", "南京工程学院", "南京医科大学", "徐州师范大学", "徐州工程学院",
        "南京农业大学", "中国药科大学", "南京审计学院", "南京信息工程大学", "江苏科技大学", "常州大学", "江苏广播电视大学",
        "南京市广播电视大学", "苏州科技学院", "淮海工学院", "淮阴工学院", "盐城师范学院", "淮阴师范学院", "江苏理工学院",
        "徐州医学院", "江苏教育学院", "西交利物浦大学", "南京艺术学院", "常熟理工学院", "南通纺织职业技术学院",
        "南通职业大学", "南通市广播电视大学", "南通航运职业技术学院", "南京师范大学泰州学院", "徐州建筑职业技术学院",
        "南京化工职业技术学院", "泰州职业技术学院", "扬州职业大学", "南京铁道职业技术学院", "宿迁学院", "淮安信息职业技术学院",
        "江苏畜牧兽医职业技术学院", "中国科学技术大学苏州研究院", "紫琅职业技术学院", "镇江市高等专科学校", "苏州职业大学",
        "沙洲工学院", "江苏信息职业技术学院", "苏州工业园区职业技术学院", "无锡职业技术学院", "苏州经贸职业技术学院",
        "中国传媒大学南广学院", "金陵科技学院", "江苏海事职业技术学院", "南京信息职业技术学院", "南通农业职业技术学院",
        "南京特殊教育职业技术学院", "徐州工业职业技术学院", "江苏食品职业技术学院", "应天职业技术学院", "盐城工学院",
        "常州工学院", "金肯职业技术学院", "硅湖职业技术学院", "南京森林警察学院", "苏州卫生职业技术学院",
        "扬州工业职业技术学院", "南京交通职业技术学院", "钟山职业技术学院", "苏州工业职业技术学院", "江苏经贸职业技术学院",
        "无锡南洋职业技术学院", "无锡工艺职业技术学院", "江苏财经职业技术学院", "常州纺织服装职业技术学院",
        "常州工程职业技术学院", "常州机电职业技术学院", "常州轻工职业技术学院", "河海大学常州校区", "常州信息职业技术学院",
        "健雄职业技术学院", "江海职业技术学院", "江苏警官学院", "江苏农林职业技术学院", "连云港职业技术学院",
        "连云港师范高等专科学校", "南京工业职业技术学院", "南京晓庄学院", "无锡商业职业技术学院", "盐城卫生职业技术学院",
        "盐城纺织职业技术学院", "苏州农业职业技术学院", "苏州工艺美术职业技术学院", "江苏省交通技师学院", "三江学院",
        "扬州环境资源职业技术学院", "南京理工大学泰州科技学院", "解放军理工大学", "昆山登云科技职业学院", "炎黄职业技术学院",
        "九州职业技术学院", "南京人口管理干部学院", "无锡城市职业技术学院", "扬州教育学院", "中国矿业大学徐海学院",
        "江苏建康职业学院", "苏州港大思培科技职业学院"
    ],

    anhui: [
        "安徽大学", "安徽师范大学", "安徽工业大学", "安徽医科大学", "安徽农业大学", "安徽理工大学(原淮南工业学院)",
        "合肥工业大学", "合肥学院", "安徽财经大学", "安徽中医学院", "安徽科技学院", "解放军电子工程学院", "安庆师范学院",
        "皖西学院", "皖南医学院", "阜阳师范学院", "淮北煤炭师范学院", "淮南师范学院", "蚌埠医学院", "巢湖学院",
        "安徽工程大学", "安徽建筑工业学院", "淮南联合大学", "滁州学院", "安徽电子信息职业技术学院", "黄山学院",
        "安徽行政学院安徽经济管理学院", "铜陵学院", "三联职业技术学院", "河海大学文天学院", "宣城职业技术学院",
        "马鞍山职业技术学院", "中国科学技术大学", "中国计算机函授学院", "淮北师范大学", "池州学院", "安徽省教育厅",
        "宿州学院", "蚌埠学院", "安徽水利水电职业技术学院", "安徽新华学院", "合肥师范学院", "六安职业技术学院",
        "安徽医学高等专科学校", "安徽省教育招生考试院", "安徽中医药高等专科学校", "安庆医药高等专科学校",
        "安徽绿海商务职业学院", "安徽工商职业学院", "安徽审计职业学院", "安徽商贸职业技术学院", "安徽机电职业技术学院",
        "毫州师范高等专科学校"
    ],

    shandong: [
        "山东大学", "山东科技大学", "山东师范大学", "山东理工大学", "山东农业大学", "山东中医药大学", "济南大学", "青岛大学",
        "中国海洋大学", "烟台大学", "烟台职业学院", "曲阜师范大学", "中国石油大学", "山东工商学院", "青岛农业大学",
        "山东建筑大学", "山东轻工业学院", "山东财政学院", "山东经济学院", "山东教育学院", "山东大学威海分校", "山东艺术学院",
        "山东工艺美术学院", "青岛理工大学", "青岛科技大学", "鲁东大学", "临沂师范学院", "泰山医学院", "聊城大学", "滨州学院",
        "潍坊学院", "山东交通学院", "德州学院", "泰山学院", "滨州医学院", "济宁医学院", "中华女子学院山东分院",
        "山东青年政治学院", "山东省农业管理干部学院", "山东南山职业技术学院", "济宁市电化教育馆", "济宁学院", "潍坊医学院",
        "枣庄学院", "山东警察学院", "山东协和职业技术学院", "哈尔滨工业大学(威海)", "青岛远洋船员学院", "山东菏泽学院",
        "济南铁道职业技术学院", "聊城职业技术学院", "山东科技职业学院", "中国农业大学(烟台)", "山东商务职业学院",
        "青岛港湾职业技术学院", "淄博职业学院", "中国海洋大学青岛学院", "山东外贸职业学院", "淄博师范高等专科学校",
        "山东菏泽医学专科学校", "烟台工程职业技术学院", "济南职业学院", "山东省工会管理干部学院", "山东外事翻译职业学院",
        "济南工程职业技术学院", "山东商业职业技术学院", "青岛职业技术学院", "山东电力高等专科学校", "山东广播电视大学",
        "青岛酒店管理职业技术学院", "青岛滨海学院", "青岛求实职业技术学院", "青岛飞洋职业技术学院", "山东医学高等专科学校",
        "山东医学高等专科学校(济南)", "青岛理工大学费县分校", "滨州职业学院", "莱芜职业技术学院", "诸城教育信息网",
        "泰安市教育局", "山东中医药高等专科学校"
    ],

    shanghai: [
        "复旦大学", "上海交通大学", "同济大学", "上海海洋大学", "上海外国语大学", "上海财经大学", "东华大学",
        "华东师范大学", "华东理工大学", "上海师范大学", "上海大学", "上海工程技术大学", "上海第二医科大学", "上海第二工业大学",
        "上海理工大学", "上海电视大学", "上海海事大学（上海海运学院）", "复旦大学医学院（原上海医科大学）", "上海应用技术学院",
        "上海电力学院", "上海音乐学院", "上海对外贸易学院", "华东政法学院", "上海市经济管理干部学院", "上海思博职业技术学院",
        "上海国家会计学院", "上海立信会计学院", "上海交通职业技术学院", "上海工商外国语学院", "上海金融学院",
        "上海医疗器械高等专科学校", "上海政法学院", "上海杉达学院", "上海电机学院", "上海海关高等专科学校",
        "东海职业技术学院", "上海公安高等专科学校", "上海戏剧学院", "上海外国语大学贤达经济人文学院",
        "复旦大学上海视觉艺术学院", "上海工艺美术职业学院", "上海旅游高等专科学校", "上海旅游高等专科学校"
    ],

    zhejiang: [
        "浙江财经学院东方学院", "宁波诺丁汉大学", "宁波大学", "浙江工商大学", "中国计量学院", "杭州师范大学", "浙江理工大学",
        "杭州电子科技大学", "浙江工业大学", "浙江大学", "上海财经大学浙江学院", "中国美术学院", "丽水学院", "丽水职业技术学院",
        "义乌工商职业技术学院", "台州学院", "台州科技职业学院", "台州职业技术学院", "同济大学浙江学院", "嘉兴学院",
        "嘉兴职业技术学院", "宁波大红鹰学院", "宁波市教育局", "宁波职业技术学院", "杭州科技职业技术学院", "杭州职业技术学院",
        "浙江万里学院", "浙江东方职业技术学院", "浙江中医药大学", "浙江交通职业技术学院", "浙江传媒学院", "浙江农林大学",
        "浙江医学高等专科学校", "浙江同济科技职业学院", "浙江商业职业技术学院", "浙江外国语学院", "浙江大学城市学院",
        "浙江工贸职业技术学院", "浙江师范大学", "浙江广播电视大学", "浙江建设职业技术学院", "浙江旅游职业学院",
        "浙江机电职业技术学院", "浙江树人大学", "浙江水利水电专科学校", "浙江汽车职业技术学院", "浙江海洋学院",
        "浙江省教育考试院", "浙江科技学院", "浙江纺织服装职业技术学院", "浙江纺织服装职业技术学院", "浙江经济职业技术学院",
        "浙江经贸职业技术学院", "浙江艺术职业学院", "浙江警官职业学院", "浙江警察学院", "浙江财经学院", "浙江越秀外国语学院",
        "浙江金融职业学院", "温州医学院", "温州大学", "温州科技职业学院", "温州职业技术学院", "湖州师范学院",
        "湖州职业技术学院", "绍兴文理学院", "衢州学院", "金华职业技术学院"
    ],

    jiangxi: [
        "南昌大学", "江西财经大学", "江西农业大学", "东华理工大学", "江西师范大学", "华东交通大学", "南昌大学医学院",
        "江西教育学院", "江西科技师范学院", "井冈山大学", "南昌工程学院", "赣南师范学院", "江西工业职业技术学院工业贸易分院",
        "南昌高等专科学校", "景德镇陶瓷学院", "江西蓝天学院"
    ],

    fujian: [
        "福建师范大学", "福建医科大学", "福州大学", "厦门大学", "华侨大学", "集美大学", "仰恩大学", "厦门理工学院",
        "漳州师范学院", "福建中医学院", "福建交通职业技术学院", "福建工程学院", "泉州师范学院", "厦门南洋学院",
        "闽江学院新华都商学院", "龙岩学院", "黎明职业大学", "闽江学院", "福建广播电视大学", "厦门国家会计学院",
        "福建商业高等专科学校", "福建水利电力职业技术学院", "福州大学阳光学院", "福建师范大学协和学院",
        "福建农林大学金山学院", "厦门大学嘉庚学院", "集美大学诚毅学院", "漳州天福茶职业技术学院", "武夷山职业学院",
        "福建农林大学", "武夷学院", "宁德师范学院", "莆田学院", "厦门软件职业技术学院", "厦门城市职业学院", "华厦职业学院",
        "福建江夏学院", "福建经济管理干部学院", "福建儿童发展职业学院", "闽南理工学院", "福州大学至诚学院",
        "福建师范大学闽南科技学院", "福建农林大学东方学院", "华侨大学福建音乐学", "福建林业职业技术学院",
        "福建农业职业技术学院", "福建电力职业技术学院", "福建对外经济贸易职业技术学院", "福建警官职业学院",
        "福建卫生职业技术学院", "福建艺术职业学院", "福建体育职业技术学院", "福建生物工程职业技术学院", "福建教育学院",
        "福建财会管理干部学院", "福建省政法管理干部学院", "福建华南女子职业学院", "福州教育学院", "福州海峡职业技术学院",
        "福州科技职业技术学院", "福州英华职业学院", "福州黎明职业技术学院", "福州软件职业技术学院", "福州外语外贸职业技术学院",
        "泉州医学高等专科学校", "泉州华光摄影艺术职业学院", "泉州信息职业技术学院", "泉州轻工职业技术学院",
        "泉州经贸职业技术学院", "泉州纺织服装职业学院", "泉州泰山航海职业学院", "厦门海洋职业技术学院",
        "厦门华天涉外职业技术学院", "厦门兴才职业技术学院", "漳州城市职业学院", "漳州卫生职业学院", "漳州吉马印刷职业技术学院",
        "闽西职业技术学院", "宁德师范高等专科学校", "湄洲湾职业技术学院", "德化陶瓷职业技术学院", "三明职业技术学院",
        "闽北职业技术学院", "厦门安防科技职业学院", "福建警察学院", "福建信息职业技术学院", "福州职业技术学院",
        "宁德职业技术学院", "泉州理工职业学院", "三明学院", "厦门东海职业技术学院", "厦门医学高等专科学校",
        "华侨大学厦门工学院", "漳州职业技术学院"
    ],

    hubei: [
        "中国地质大学", "华中农业大学", "华中师范大学", "湖北大学", "武汉理工大学", "武汉大学", "武汉科技大学", "江汉大学",
        "三峡大学", "中南财经政法大学", "中南民族大学", "华中科技大学同济医学院", "湖北民族学院", "湖北理工学院",
        "湖北第二师范学院", "湖北经济学院", "湖北警官学院", "湖北师范学院", "武汉科技学院", "武汉工程大学",
        "武汉职业技术学院", "黄冈师范学院", "郧阳医学院", "襄樊学院", "武汉工业学院", "鄂州职业大学", "湖北广播电视大学",
        "武汉船舶职业技术学院", "荆楚理工学院", "中南财经政法大学武汉学院", "武汉体育学院", "湖北中医学院",
        "长江职业学院", "中南汽车科技大学", "襄樊职业技术学院", "华中科技大学武昌分校", "长江大学", "恩施职业技术学院",
        "武汉商业服务学院", "湖北汽车工业学院", "湖北美术学院", "武汉交通职业学院", "湖北职业技术学院", "黄冈职业技术学院",
        "长江大学工程技术学院", "武汉大学东湖分校", "湖北三峡职业技术学院", "华中师范大学武汉传媒学院", "武汉电子信息专修学院",
        "武汉工程大学邮电与信息工程学院", "荆州职业技术学院", "武汉工业学院工商学院", "中南民族大学工商学院",
        "武汉科技大学城市学院", "中国地质大学江城学院", "湖北城市建设职业技术学院", "武汉铁路职业技术学院",
        "江汉艺术职业学院", "武汉民政职业学院", "武汉信息传播职业技术学院", "武汉音乐学院", "武汉工业职业技术学院",
        "武汉工程职业技术学院", "湖北水利水电职业技术学院", "武汉大学武汉校友会专修学院"
    ],

    hunan: [
        "湖南师范大学", "湖南广播电视大学", "中南大学", "湘潭大学", "吉首大学", "国防科技大学", "南华大学", "湖南工程学院",
        "怀化医学高等专科学校", "湖南计算机高等专科学校", "湖南中医学院", "湖南环境生物职业技术学院", "长沙航空职业技术学院",
        "湖南科技大学", "湖南文理学院", "湖南工学院", "湖南理工学院", "株洲工学院", "衡阳师范学院", "湖南铁道职业技术学院",
        "湖南生物机电学院网站", "长沙理工大学", "长沙学院", "湖南科技学院", "湖南财经高等专科学校", "湖南第一师范"
    ],

    henan: [
        "郑州大学", "中国人民解放军信息工程大学", "河南理工大学", "河南师范大学", "河南大学", "河南农业大学", "河南科技大学",
        "河南工业大学", "河南城建学院", "开封大学", "焦作大学", "中州大学", "洛阳理工学院", "黄河科技大学",
        "河南财经政法大学成功学院", "华北水利水电学院", "河南财经政法大学", "河南工程学院", "河南机电高等专科学校",
        "河南警察学院", "河南中医学院", "河南商业高等专科学校", "郑州牧业工程高等专科学校", "郑州航空工业管理学院",
        "郑州轻工业学院", "洛阳师范学院", "焦作师范高等专科学校", "平顶山学院", "平顶山工业职业技术学院", "安阳师范学院",
        "信阳师范学院", "新乡医学院", "周口师范学院", "黄淮学院", "中原工学院", "黄河水利职业技术学院", "许昌学院",
        "新乡学院", "郑州电力高等专科学校", "商丘师范学院", "河南科技学院", "河南财政税务高等专科学校", "南阳理工学院",
        "郑州大学西亚斯国际学院", "信阳农业高等专科学校", "鹤壁职业技术学院", "商丘医学高等专科学校", "中原工学院信息商务学院",
        "新乡医学院三全学院", "许昌职业技术学院", "郑州大学体育学院", "商丘医学院高等专科学校", "郑州铁路职业技术学院",
        "河南工业职业技术学院", "商丘职业技术学院", "漯河医学高等专科学校", "永城职业学院", "郑州旅游职业学院",
        "河南大学民生学院", "信阳师范学院华锐学院", "嵩山少林武术职业学院", "河南交通职业技术学院", "河南化工职业学院",
        "漯河职业技术学院", "河南理工大学万方科技学院", "河南质量工程职业学院"
    ],

    guangdong: [
        "广东工业大学", "广东外语外贸大学", "广东广播电视大学", "广州大学", "广州中医药大学", "深圳大学", "华南理工大学",
        "华南农业大学", "华南师范大学", "中山大学", "中山医科大学", "惠州学院", "汕头大学", "广东海洋大学", "暨南大学",
        "佛山大学", "韶关大学", "南方医科大学", "嘉应大学", "五邑大学", "广东商学院", "广东教育学院", "广东轻工职业技术学院",
        "广东石油化工学院", "广东技术师范学院", "广东医学院", "广东白云职业技术学院", "广东农工商职业技术学院",
        "广州航海高等专科学校", "广州医学院", "东莞理工学院", "私立华联学院", "肇庆学院", "番禺职业技术学院",
        "广州市轻工业学校", "广东药学院", "韩山师范学院", "广州民航职业技术学院", "星海音乐学院", "广州市广播电视大学",
        "广州美术学院", "广东外语艺术职业学院", "广州体育学院", "广东金融学院", "广东科学技术职业学院",
        "广东女子职业技术学院", "广东纺织职业技术学院", "广州体育职业技术学院", "民办南华工商学院",
        "广东化工制药职业技术学院", "顺德职业技术学院", "广州城市职业学院", "广东工贸职业技术学院", "中山职业技术学院",
        "广东文艺职业学院", "广州铁路职业技术学院", "广东岭南职业技术学院", "深圳市奥斯翰外语学校",
        "广东外语外贸大学南国商学院", "广东机电职业技术学院", "华南理工大学广州汽车学院", "河源职业技术学院",
        "中山火炬职业技术学院", "广东技术师范学院天河学院", "江门职业技术学院", "广东交通职业技术学院", "南方科技大学",
        "广州科技贸易职业学院", "深圳信息职业技术学院", "广东商学院华商学院", "广州华立科技职业学院"
    ],

    guangxi: [
        "广西大学", "广西师范大学", "广西民族大学", "广西医科大学", "广西师范学院", "广西工学院", "广西中医学院",
        "广西大学梧州分校", "桂林电子科技大学", "桂林理工大学", "广西机电职业技术学院", "桂林旅游高等专科学校",
        "桂林师范高等专科学校", "桂林航天工业高等专科学校", "右江民族医学院", "河池学院", "钦州学院", "百色学院"
    ],

    hainan: ["海南大学", "琼州大学", "海南师范大学", "海南医学院", "海口经济职业技术学院", "琼台师范高等专科学校",
        "海南软件职业技术学院", "海南大学三亚学院", "海南政法职业学院", "海南职业技术学院"
    ],

    chongqing: [
        "重庆大学", "四川外语学院", "重庆医科大学", "重庆工商大学", "重庆邮电大学", "西南政法大学", "西南师范大学",
        "第三军医大学", "重庆交通大学", "重庆师范大学", "重庆三峡学院", "四川美术学院", "长江师范学院", "重庆理工大学",
        "重庆科技学院", "重庆文理学院", "重庆电力高等专科学校", "重庆师范大学涉外商贸学院", "重庆教育学院",
        "重庆职业技术学院", "重庆邮电学院高职二分院", "重庆海联学院"
    ],

    sichuan: [
        "四川大学", "四川师范大学", "四川农业大学", "成都理工大学", "成都中医药大学", "西南交通大学", "西南财经大学",
        "西南科技大学", "电子科技大学", "攀枝花学院", "中国民航飞行学院", "西华大学", "西华师范大学", "四川理工学院",
        "四川烹饪高等专科学校", "成都电子机械高等专科学校", "成都信息工程学院", "西南交通大学峨眉分校", "西南民族大学",
        "西南石油大学", "乐山师范学院", "川北医学院", "宜宾学院", "内江师范学院", "泸州医学院", "四川文理学院", "成都大学",
        "成都航空职业技术学院", "西昌师范高等专科学校", "乐山职业技术学院", "四川音乐学院成都美术学院", "绵阳职业技术学院",
        "电子科技大学MBA教育中心", "成都体育学院", "四川建筑职业技术学院", "成都天一学院", "成都医学院",
        "四川化工职业技术学院", "四川国际标榜职业学院", "四川水利职业技术学院", "四川中医药高等专科学校", "西昌学院",
        "四川工程职业技术学院", "沪州职业技术学院", "内江职业技术学院", "达州职业技术学院", "泸州职业技术学院",
        "四川邮电职业技术学院", "西昌农业高等专科学校", "成都东软信息技术职业学院", "四川师范大学成都分院",
        "四川广播电视大学", "成都信息工程学院银杏酒店管理学院", "阿坝师范高等专科学校", "四川交通职业技术学院"
    ],

    guizhou: [
        "贵州大学", "贵州师范大学", "贵州财经学院", "贵州民族学院", "贵阳中医学院", "贵阳医学院", "遵义医学院",
        "铜仁学院", "黔南民族师范学院", "贵州电子信息职业技术学院", "贵州省毕节学院", "遵义师范学院",
        "贵州科技工程职业技术学院", "贵阳学院", "安顺学院", "黔西南民族师范高等专科学校", "贵州商业高等专科学校"
    ],

    yunnan: [
        "云南大学", "云南师范大学", "云南农业大学", "昆明理工大学", "云南财经大学", "云南民族大学", "云南警官学院",
        "昆明医学院", "西南林学院", "楚雄师范学院", "曲靖师范学院", "昆明冶金高等专科学校", "云南大学滇池学院",
        "昆明学院(原昆明大学)", "云南艺术学院", "红河学院", "昭通师范高等专科学校", "昆明理工大学津桥学院",
        "丽江师范高等专科学校", "楚雄医学高等专科学校", "曲靖医学高等专科学校"
    ],

    xizang: [
        "西藏民族学院"
    ],

    shaanxi: [
        "西北大学", "西安交通大学", "长安大学", "西安电子科技大学", "西安理工大学", "西安建筑科技大学", "西北工业大学",
        "西北农林科技大学", "陕西师范大学", "第四军医大学", "陕西理工学院", "西安科技大学", "西安邮电学院",
        "西安石油大学", "西北政法大学", "宝鸡文理学院", "西安财经学院", "陕西教育学院", "渭南师范学院", "西安思源学院",
        "空军工程大学", "陕西工业职业技术学院未入网", "延安大学", "陕西中医学院", "西安体育学院", "西安美术学院",
        "西安音乐学院", "西安文理学院", "西安电力高等专科学校", "西安医学院", "陕西能源职业技术学院", "陕西科技大学",
        "西京学院", "西安欧亚学院", "西安交通大学城市学院", "榆林学院", "陕西国际商贸职业学院", "西安航空职业技术学院",
        "陕西铁路工程职业技术学院", "陕西国防工业职业技术学院", "陕西电子信息职业技术学院", "宝鸡职业技术学院",
        "西安科技商贸职业学院", "西安高新科技职业学院未入网", "陕西警官职业学院", "西安汽车科技职业学院", "西安三资职业学院",
        "陕西邮电职业技术学院未入网", "渭南职业技术学院"
    ],

    gansu: [
        "兰州大学", "甘肃农业大学", "兰州理工大学", "西北师范大学", "西北民族学院", "兰州交通大学", "兰州商学院",
        "甘肃政法学院", "兰州城市学院", "甘肃中医学院", "河西学院", "天水师范学院", "陇东学院", "甘肃广播电视大学",
        "甘肃联合大学", "兰州石化职业技术学院", "兰州工业高等专科学校", "兰州职业技术学院", "甘肃林业职业技术学院",
        "甘肃钢铁职业技术学院", "甘肃行政学院", "西北民族大学"
    ],

    ningxia: [
        "宁夏大学", "宁夏医科大学", "北方民族大学", "宁夏广播电视大学", "宁夏财经职业技术学院", "宁夏建设职业技术学院",
        "宁夏工商职业技术学院"
    ],

    qinghai: [
        "青海大学", "青海师范大学", "青海广播电视大学", "青海民族学院", "青海医学院", "青海卫生职业技术学院",
        "青海交通职业技术学院"
    ],

    xinjiang: [
        "新疆大学", "新疆农业大学", "新疆医科大学", "新疆师范大学", "乌鲁木齐职业大学", "塔里木大学", "石河子大学",
        "新疆农业职业技术学院", "新疆财经大学", "新疆轻工职业技术学院", "新疆艺术学院", "喀什师范学院", "伊犁师范学院",
        "武警乌鲁木齐指挥学校"
    ],

    xianggang: [
        "香港中文大学", "香港理工大学", "香港科技大学", "香港城市大学", "香港浸会大学", "岭南大学", "香港经贸管理学院",
        "香港艺术中心艺术学院", "香港教育学院", "珠海书院Chu", "Hai", "College", "涉外贸易管理学院", "中国文理学院"
    ],

    aomen: [
        "澳门大学", "澳门科技大学", "亚洲（澳门）国际公开大学", "澳门理工学院", "旅游学院"
    ],

    taiwan: [
        "中国文化大学", "台湾中央大学", "台湾师范大学", "台湾海洋大学", "台湾科技大学", "台北大学", "台北科技大学",
        "高雄大学", "高雄师范大学", "彰化师范大学", "慈济大学", "中央警察大学", "清华大学(台湾)", "南华大学", "东华大学",
        "逢甲大学", "交通大学", "东吴大学", "东海大学", "大同大学", "淡江大学", "私立義守大學", "真理大学", "大叶大学",
        "阳明大学", "國立嘉義大學", "世新大学", "政治大学", "朝阳科技大学", "南台科技大学", "嘉南药理科技大学", "中原大学",
        "华梵大学", "长庚大学", "铭传大学", "云林科技大学", "静宜大学", "中华大学", "中华医事学院", "台湾体育学院",
        "台北市立体育学院", "海军军官学校", "空军军官学校", "文藻外语学院", "佛光人文社会学院", "稻江科技暨管理学院",
        "辅英技术学院", "屏东商业技术学院"
    ]

};
